content/posts/learn_in_public.md
+++
title = "Learn In Public"
author = ["Daniel Biasiotto"]
date = 2021-12-22T23:59:00+01:00
tags = ["concept", "mentalModel"]
draft = false
+++

-   Source: <https://www.swyx.io/learn-in-public/>
-   Author: [Shawn Wang]({{< relref "shawn_wang.md" >}})


## Habits {#habits}

-   have a habit of creating exhaust
-   [make the thing you wish you had found]({{< relref "make_the_thing_you_wish_you_had_found.md" >}})
-   talk to yoursef from 3 months ago
    -   you were wrong, you'll be wrong, just try to be less wrong k?


## Open Source Knowledge {#open-source-knowledge}

-   document what you did and the problems you solved
    -   and do it well! what you wish you had when you were researching

Great example of a long running [TIL]({{< relref "til.md" >}}):

-   <https://github.com/jbranchaud/til>